
#pragma once
#define 정수형 unsigned int
#define 음_정수형 int
#define 문자형 char 
#define 실수형 double
#define 현재버젼 1.0
#define 캐릭개수 60
//dmdrldlt

static FILE *savefile;
//
class chara
{
	public:
		//변수를 선언합니다.
		//레이팅정보를 수집합니다.
		정수형 연승 = 0;
		정수형 연패 = 0;
		음_정수형 레이팅 = 0;
		//kda및 승률을 선언합니다
		정수형 킬 = 0;
		정수형 데스 = 0;
		정수형 어시스트 = 0;
		정수형 게임횟수 = 0;
		정수형 승수 = 0;
		정수형 패수 = 0;
		실수형 승률 = 0;
		//특성정보를 선언합니다.
		정수형 백조의부름 = 0;
		정수형 회복의삼지창 = 0;
		정수형 밤의사냥꾼 = 0;
		정수형 비겁한고블린 = 0;
		정수형 깨달음 = 0;
		정수형 흑마법 = 0;
		정수형 음과양의조화 = 0;
		정수형 아레스의투구 = 0;
		정수형 라식 = 0;
		정수형 축복의장화 = 0;
		정수형 신비로운반지 = 0;
		정수형 치명적인탄환 = 0;
		정수형 깨물기 = 0;
		정수형 이동의즐거움 = 0;
		정수형 판다렌의화염작렬 = 0;
		정수형 마법부스터 = 0;
		정수형 단단한벽 = 0;
		정수형 마법의망토 = 0;
		정수형 고대신비의마법서 = 0;
		정수형 산뜻한기분 = 0;
		정수형 갈망의검 = 0;
		정수형 지배전투의기본 = 0;
		정수형 지배푸른영기 = 0;
		정수형 마법전투의기본 = 0;
		정수형 마법푸른영기 = 0;
		정수형 강인한체력 = 0;
		정수형 활력증진 = 0;
		정수형 저돌적인공격방식 = 0;
		정수형 신비한공격방식 = 0;
		정수형 투쟁갑옷무력화 = 0;
		정수형 투쟁저항무력화 = 0;
		정수형 지배갑옷무력화 = 0;
		정수형 지배저항무력화 = 0;
		정수형 마법갑옷무력화 = 0;
		정수형 마법저항무력화 = 0;
		정수형 신비의방패 = 0;
		정수형 저항의방패 = 0;
		정수형 경험치사기꾼 = 0;
		정수형 골드도둑 = 0;
		정수형 투쟁타격용분 = 0;
		정수형 투쟁마법용분 = 0;
		정수형 지배물리용분 = 0;
		정수형 지배마법용분 = 0;
		정수형 마법물리용분 = 0;
		정수형 마법마법용분 = 0;
		정수형 긍지최후의방어 = 0;
		정수형 축복최후의방어 = 0;
		정수형 집중사격 = 0;
		정수형 무자비한연사 = 0;
		정수형 환상적인공격 = 0;
		정수형 제우스의분노 = 0;
		정수형 오디세우스의성검 = 0;
		정수형 대마법신비로운메테오 = 0;
		정수형 마법펀치 = 0;
		정수형 곰발바닥 = 0;
		정수형 토르의분노 = 0;
		정수형 마법의점멸 = 0;
		정수형 신의가호 = 0;
		//함수를 선언합니다.
		void input(int kill, int death, int assist)//kda를 입력받습니다.
		{
			킬 = 킬 + kill;
			데스 = 데스 + death;
			어시스트 = 어시스트 + assist;
		}
		void WOL(BOOL wolcheck)//TRUE = WIN, FALSE = LOSE
		{
			게임횟수++;
			if (wolcheck == TRUE)
			{
				승수++;
				연승++;
				연패 = 0;
				//레이팅을 변경합니다
				int 레이팅상승임시변수 = 연승 * 10;
				if (레이팅상승임시변수 > 50)
				{
					레이팅상승임시변수 = 50;
				}
				레이팅 += 레이팅상승임시변수;
			}
			else if (wolcheck == FALSE)
			{
				패수++;
				연패++;
				연승 = 0;
				//레이팅을 변경합니다
				int 레이팅상승임시변수 = 연패 * 10;
				if (레이팅상승임시변수 > 50)
				{
					레이팅상승임시변수 = 50;
				}
				레이팅 -= 레이팅상승임시변수;
			}
			if (게임횟수 != 0)
			{
				승률 = 승수 / 게임횟수;
			}
		}
		void init()
		{
			 연승 = 0;
			 연패 = 0;
			 레이팅 = 0;
			 킬 = 0;
			 데스 = 0;
			 어시스트 = 0;
			 게임횟수 = 0;
			 승수 = 0;
			 패수 = 0;
			 승률 = 0;
			 백조의부름 = 0;
			 회복의삼지창 = 0;
			 밤의사냥꾼 = 0;
			 비겁한고블린 = 0;
			 깨달음 = 0;
			 흑마법 = 0;
			 음과양의조화 = 0;
			 아레스의투구 = 0;
			 라식 = 0;
			 축복의장화 = 0;
			 신비로운반지 = 0;
			 치명적인탄환 = 0;
			 깨물기 = 0;
			 이동의즐거움 = 0;
			 판다렌의화염작렬 = 0;
			 마법부스터 = 0;
			 단단한벽 = 0;
			 마법의망토 = 0;
			 고대신비의마법서 = 0;
			 산뜻한기분 = 0;
			 갈망의검 = 0;
			 지배전투의기본 = 0;
			 지배푸른영기 = 0;
			 마법전투의기본 = 0;
			 마법푸른영기 = 0;
			 강인한체력 = 0;
			 활력증진 = 0;
			 저돌적인공격방식 = 0;
			 신비한공격방식 = 0;
			 투쟁갑옷무력화 = 0;
			 투쟁저항무력화 = 0;
			 지배갑옷무력화 = 0;
			 지배저항무력화 = 0;
			 마법갑옷무력화 = 0;
			 마법저항무력화 = 0;
			 신비의방패 = 0;
			 저항의방패 = 0;
			 경험치사기꾼 = 0;
			 골드도둑 = 0;
			 투쟁타격용분 = 0;
			 투쟁마법용분 = 0;
			 지배물리용분 = 0;
			 지배마법용분 = 0;
			 마법물리용분 = 0;
			 마법마법용분 = 0;
			 긍지최후의방어 = 0;
			 축복최후의방어 = 0;
			 집중사격 = 0;
			 무자비한연사 = 0;
			 환상적인공격 = 0;
			 제우스의분노 = 0;
			 오디세우스의성검 = 0;
			 대마법신비로운메테오 = 0;
			 마법펀치 = 0;
			 곰발바닥 = 0;
			 토르의분노 = 0;
			 마법의점멸 = 0;
			 신의가호 = 0;
		}
};
struct newdata//일단 총합데이터에 필요한 데이터가 모자라니깐... chara에 넣긴 뭐하고
{
	int 주포지션 = 0;//0=미정,1=딜,2=탱,3=힐
	int 탱커 = 0;//
	int 딜러 = 0;//
	int 힐러 = 0;//
	void init()
	{
			 주포지션 = 0;//0=미정,1=딜,2=탱,3=힐
			 탱커 = 0;//
			 딜러 = 0;//
			 힐러 = 0;//
	}
};
static newdata N_dataSTR;
static chara 총합;//1
static chara 요우무_r1;//2
static chara 요우무_r2;//3
static chara 요우무_하이브리드;//4
static chara 레이무;//5
static chara 치르노;//6
static chara 사쿠야_딜러;//7
static chara 사쿠야_탱커;//8
static chara 이쿠;//9
static chara 무라사_물리;//10
static chara 무라사_마법;//11
static chara 무라사_하이브리드;//12
static chara 레이센_탱커;//13
static chara 레이센_딜러;//14
static chara 레이센_하이브리드;//15
static chara 앨리스_물리;//16
static chara 앨리스_마법;//17
static chara 앨리스_하이브리드;//18
static chara 레밀리아;//19
static chara 플랑도르;//20
static chara 흑화치르노;//21
static chara 어드밴스드요우무_r1;//22
static chara 어드밴스드요우무_r2;//23
static chara 어드밴스드요우무_r3;//24
static chara 마리사_딜러;//25
static chara 마리사_힐러;//26
static chara 마리사_하이브리드;//27
static chara 유카리;//28
static chara 모코우;//29
static chara 어드밴트모미지;//30
static chara 파츄리;//31
static chara 우츠호;//32
static chara 스와코;//33
static chara 텐시_딜러;//34
static chara 텐시_탱커;//35
static chara 어드밴트치르노;//36
static chara 코마치;//37
static chara 아야;//38
static chara 어드밴스드메이린;//39
static chara 사나에;//40
static chara 레티;//41
static chara 유유코;//42
static chara 에이린;//43
static chara 사토리;//44
static chara 바쿠렌;//45
static chara 카구야;//46
static chara 미코;//47
static chara 누에;//48
static chara 스이카;//49
static chara 시키;//50
static chara 유카;//51
static chara 흑화요우무;//52
static chara 어드밴트플랑;//53
static chara 헤이메이린;//54
static chara 홍메이린;//55
static chara 흑화카구야;//56
static chara 모미지;//57
static chara 흑화무라사;//58
static chara 조온;//59
static chara 악마레이무;//60
static chara 흑화텐시;//61
//구조체를 버릴거야 버릴거라구! 이히히히!
//이제 구조체는 통합정보를 볼때만 씁니다. 그렇게 만들거야
struct dataSTR
{
	int test = 3;
	실수형 버젼정보=0;
	double vernum = 0 ;
	int 게임횟수 = 0 ;//
	int 승수 = 0 ;//
	int 패수 = 0 ;//
	실수형 승률 = 0 ;//

	int 킬 = 0 ;//
	int 데스 = 0 ;//
	int 어시스트 = 0 ;//

	int 주포지션 = 0 ;//0=미정,1=딜,2=탱,3=힐
	int 탱커 = 0 ;//
	int 딜러 = 0 ;//
	int 힐러 = 0 ;//


	정수형 피해타입 = 0 ;//
	정수형 마법 = 0 ;//
	정수형 물리 = 0 ;//
	정수형 마법계수물리뎀 = 0 ;//
	정수형 복합 = 0;

	정수형 탱커점수 = 0 ;//
	정수형 딜러점수 = 0 ;//
	정수형 힐러점수 = 0 ;//


	정수형 요우무_r1 = 0 ;//
	정수형 요우무_r2 = 0 ;//
	정수형 요우무_하이브리드 = 0 ;//
	정수형 레이무 = 0 ;//
	정수형 치르노 = 0 ;//
	정수형 사쿠야_딜러 = 0 ;
	정수형 사쿠야_탱커 = 0 ;
	정수형 이쿠 = 0 ;//
	정수형 무라사_물리 = 0 ;//
	정수형 무라사_마법 = 0 ;//
	정수형 무라사_하이브리드 = 0 ;//
	정수형 레이센_탱커 = 0 ;//
	정수형 레이센_딜러 = 0 ;//
	정수형 레이센_하이브리드 = 0 ;//
	정수형 앨리스_물리 = 0 ;//
	정수형 앨리스_마법 = 0 ;//
	정수형 앨리스_하이브리드 = 0 ;//
	정수형 레밀리아 = 0 ;//
	정수형 플랑도르 = 0 ;//
	정수형 흑화치르노 = 0 ;//
	정수형 어드밴스드요우무_r1 = 0 ;//
	정수형 어드밴스드요우무_r2 = 0 ;//
	정수형 어드밴스드요우무_r3 = 0 ;//
	정수형 마리사_딜러 = 0 ;//
	정수형 마리사_힐러 = 0 ;//
